{
  "Top song genre 2010-2019 - total 603 songs": "A pie chart is a circular graph that is broken down into segments (i.e slices of pie). This Pie chart shows the top song genre between years 2010-2019. Out of total 603 songs, the most popular genre dance pop has 327 songs followed by pop genre which has count 60. This chart shows the dominance of pop music in popular tracks.",
  "Top Artists from 2010-2019": "This bar chart shows the top artists in years 2010 to 2019. Most popular artists are Katy Perry, Justin Bieber and Maroon 5 with 17, 16 and 15 top songs withing the time period. The artists who were consistent throughout the decade have higher number of popular tracks as compared to artists such as Ed Sheeran and Ariana Grande who were popular for only within the later part of the decade.",
  "BPM Distribution in Top Songs in 2010-2019": "The Tempo of a piece of music determines the speed at which it is played, and is measured in beats per minute (BPM). Generally most of the songs are within the range 100-150 BPM, especially the pop music tracks. The average pop song has a tempo of 116 beats per minute",
  "Relationship between Danceability and Energy of Top songs": "Danceability is measured using a mixture of song features such as beat strength, tempo stability, and overall tempo. The value returned determines the ease with which a person could dance to a song over the course of the whole song. Energy is a measure from 0.0 to 1.0 and represents a perceptual measure of intensity and activity. Typically, energetic tracks feel fast, loud, and noisy.",
  "Relation between Song popularity and Song duration": "This graph plots the relation between Song popularity and Song duration. It can be clearly seen that most of the popular songs have duration between 3 to 4 minutes. ",
  "Artist Popularity in 2010-2019": "This graph shows the artist popularity based on their songs in the years 2010 to 2019. Even though Katy Perry had more number of popular songs than any other artists, the artists Justin Bieber and Maroon 5 were more popular as some of their tracks were too popular.",
  "2019 Top songs Genre comparison": "This graph shows the most popular genre for the popular songs in 2019. Showing the same trend as previous years, 2019 also has top songs with genre as dance pop and pop respectively.",
  "Song attribute Comparison for different Genre-2019": "This graph compares different attributes of top songs in 2019. The attributes compared are Beats per Minute, Loveliness, speechiness and length of the song. Some of the key observations are that the length of edm, latin, reggaeton flow is quite large as compared to other genres. Beats per minutes are higher in rap and trap music.",
  "Word Cloud- Popular Genre": "Word clouds are graphical representations of word frequency that give greater prominence to words that appear more frequently in a source text. The larger the word in the visual the more common the word was in the document. It can be seen that Dance pop, pop are the large sized words indicating higher frequecy of those genres.",
  "Popular artist from 2019": "This word cloud shows the popular artists in year 2019. Ed Sheeran, Post Malone, the chainsmokers were some of the most popular artists in year 2019 shown with larger size of their respective names.",
  "Popular artists from 2010-1019": "This word cloud shows the popular artists in years 2010-2019. Katy Perry, Justin Bieber, Lady Gaga were some of the most popular artists in these years. As seen from this cloud it is not always easy to compare the frequecies based on the size of the words.",
  "Artist Popularity over Christmas": "This bar chart shows the artist popularity over Christmas. It can be seen that artists who have songs related to Christmas have higher number of popularity count in that part of the year. One good example can be a song names All I want for Christmas is you by Mariah Carey.",
  "Danceability Vs Liveliness Vs Energy in Popular songs for countries": "Different countries have different music preferences. This graph compares the popular songs in countries based on Danceability, liveliness and Energy. It can be seen that south american countries like Brazil and Argentina as well as Chile prefers high energy songs with high danceability.",
  "Popular Songs over Christmas": "This word cloud shows the popular songs during Christmas time. Here most of the songs with larger font are related to Christmas such as Last Christmas, All I want for Christmas is you etc. But there are some other songs as well such as Dance Monkey, Roxanne etc. ",
  "Popular Artist performance in last 10 years": "This graph compares the performances of popular artists over the years 2010-2019. The artists chosen were most of the top artists over last decade. It can be seen that top artists like Katy Perry, Justin Bieber performed well through the decade while some artists like Ed Sheeran and the Chainsmokers started performing well in later of the decade."
}

